RAEE/RAEE-BackEnd/app/Controllers/AuthController.php

INSERT INTO `users` (`password`, `nombre`, `tipo_usuario`, `telefono`, `dni`, `email`, `apellido`, `puntos`, `activo`, `provincia`, `municipio`, `created_at`, `updated_at`) VALUES ('$2y$10$t6gjx1W9R2M9ymutPmxQI.1UTR4IlF83RneAOSQ95.7cUx4Z.Z3ye', 'Juan', 'ciudadano', '123456789', '12345690', 'juan.perez13@test.com', 'Perez', 0, 1, 'Misiones', 'No especificado', '2025-09-15 23:55:53', '2025-09-15 23:55:53')
---
        $db->transStart();

        try {
            $userId = $this->userModel->insert($userData);