RAEE/RAEE-BackEnd/app/Controllers/AuthController.php

    public function register()
    {
        try {
            $data = $this->request->getJSON(true);

            if (!$data) {
                return $this->fail('No se recibieron datos válidos', 400);
            }

            // Validate required fields
            $requiredFields = ['nombre', 'apellido', 'email', 'password', 'dni', 'telefono', 'tipo_usuario'];
            foreach ($requiredFields as $field) {
                if (empty($data[$field])) {
                    return $this->fail("El campo {$field} es obligatorio", 400);
                }
            }

            // Validate user type
            if (!in_array($data['tipo_usuario'], ['ciudadano', 'institucion', 'tecnico'])) {
                return $this->fail('Tipo de usuario no válido', 400);
            }

            // Check if email already exists
            if ($this->userModel->where('email', $data['email'])->first()) {
                return $this->fail('El email ya está registrado', 409);
            }

            // Check if DNI already exists
            if ($this->userModel->where('dni', $data['dni'])->first()) {
---
SELECT *
FROM `users`
WHERE `email` = 'juan.perez13@test.com'
 LIMIT 1
SELECT *
FROM `users`
WHERE `dni` = '12345690'
 LIMIT 1

            $data['municipio'] = $data['municipio'] ?? 'No especificado';

            // Create user
            $userId = $this->userModel->insert($data);
---
INSERT INTO `users` (`nombre`, `email`, `password`, `telefono`, `tipo_usuario`, `puntos`, `created_at`, `updated_at`) VALUES ('Maximo rios', 'maximuz_ty@hotmail.com', '$2y$10$MzqshqxKQ1kkY1unviV0teLk/A2Mr9hnKGoA62pZm4Dxmql/F5DIC', '3765102868', 'donante', 0, '2025-09-10 19:27:08', '2025-09-10 19:27:08')

    public function login()
    {
        try {
            $data = $this->request->getJSON(true);

            if (!$data) {
                return $this->fail('No se recibieron datos válidos', 400);
            }

            // Validate required fields
            if (empty($data['dni']) || empty($data['password'])) {
                return $this->fail('DNI y contraseña son obligatorios', 400);
            }

            // Find user by DNI
            $user = $this->userModel->where('dni', $data['dni'])->first();
---
SELECT *
FROM `users`
WHERE `dni` = '45026308'
 LIMIT 1

    public function profile()
    {
        try {
            $userId = $this->getUserIdFromToken();

            if (!$userId) {
                return $this->fail('Token inválido', 401);
            }

            $user = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1