RAEE/RAEE-BackEnd/app/Controllers/CategoryController.php

    public function index()
    {
        try {
            $db = \Config\Database::connect();
            $builder = $db->table('categorias_equipos');

            $categories = $builder->select('idCategorias, Nombres_Categorias')
                                 ->where('Activo_Categorias', 1)
                                 ->orderBy('Nombres_Categorias', 'ASC')
                                 ->get()
                                 ->getResultArray();
---
SELECT `idCategorias`, `Nombres_Categorias`
FROM `categorias_equipos`
WHERE `Activo_Categorias` = 1
ORDER BY `Nombres_Categorias` ASC