RAEE/RAEE-BackEnd/app/Controllers/StateController.php

    public function index()
    {
        try {
            $db = \Config\Database::connect();
            $builder = $db->table('estados');

            $states = $builder->select('idEstados, Descripcion_Estados')
                             ->where('Activo_Estados', 1)
                             ->orderBy('idEstados', 'ASC')
                             ->get()
                             ->getResultArray();
---
SELECT `idEstados`, `Descripcion_Estados`
FROM `estados`
WHERE `Activo_Estados` = 1
ORDER BY `idEstados` ASC